/*****************************************************************************

 * File Name: IO
 * Description:  System GPIO_INTL function  
 * Author:  pine
 * Date: 2022-09-09
 
 *****************************************************************************/
 
 
 #include "io.h"
 
 
 
/******************************************************************************/
/**
 * Function Name: void INIT_GPIOAD(void)
 * Description: Initial the system GPIO 初始化AD口  
 * Param:   none
 * Return:  none
 * Author:  pine
 *****************************************************************************/

/*************************************************************/
/*                        初始化IO                           */
/*                         PORT AD                           */
/*                                                           */
/*************************************************************/
 void INIT_GPIOAD(void)
 {
    //DDR0AD = 0x00;             /********设定AD口为输入模式***********/
   // PPS0AD = 0xFF;		        /******极性选择寄存器,选择下降沿;*****/
   //PIF0AD = 0xFF;					  /***对PIFAD的每一位写1来清除标志位;***/
   // PIE0AD = 0xFF;		        /**********中断使能寄存器;***********/
  
   //DDR1AD = 0xF0;             /********设定AD口为输入模式***********/
   DDR1AD = 0x00;             /********设定AD口为输入模式***********/
    DDR0AD = 0x00; 
   ATDDIENL=0XFF; 
   ATDDIENH=0XFF; 
   ACMPC   = 0X10;
   PPS1AD = 0xFF;		        /******极性选择寄存器,选择上升沿;*****/
   PIF1AD = 0xFF;					  /***对PIFAD的每一位写1来清除标志位;***/
   PIE1AD = 0x00;		        /**********中断使能寄存器;***********/
   PIE0AD = 0x00;
   /*DDRP_DDRP1=1;
   PERP_PERP1=1;
   PTP_PTP1=1;*/
 }
 


/******************************************************************************/
/**
 * Function Name: void INIT_GPIOP(void)
 * Description: Initial the system GPIO 初始化P口  
 * Param:   none
 * Return:  none
 * Author:  pine
 *****************************************************************************/

/*************************************************************/
/*                        初始化IO                           */
/*                         PORT P                           */
/*                                                           */
/*************************************************************/
 void INIT_GPIOP(void)
 {
   DDRP = 0x0F;             /********设定P口为输出模式***********/
   PTP=0X00;
 }
 
 
 
/******************************************************************************/
/**
 * Function Name: void INIT_GPIOT(void)
 * Description: Initial the system GPIO 初始化T口  
 * Param:   none
 * Return:  none
 * Author:  pine
 *****************************************************************************/

/*************************************************************/
/*                        初始化IO                           */
/*                         PORT T                           */
/*                                                           */
/*************************************************************/
 void INIT_GPIOT(void)
 {
   DDRT = 0x0F;             /********设定PT0-PT3为输出模式***********/
   PTT=0X00;
 } 
 

/******************************************************************************/
/**
 * Function Name: void INIT_GPIOS(void)
 * Description: Initial the system GPIO 初始化S口，减小对硬件的影响 
 * Param:   none
 * Return:  none
 * Author:  pine
 *****************************************************************************/

/*************************************************************/
/*                        初始化IO                           */
/*                         PORT S                           */
/*                                                           */
/*************************************************************/
 void INIT_GPIOS(void)
 {
   DDRS = 0XFF;           
   PTS  = 0X00;
   DDRT =0XFF;
    PTT =0X01;
 }
