  
 /*****************************************************************************

 * File Name: SCI
 * Description:  SCI initial function  
 * Author:  pine
 * Date: 2022-09-09
 
 *****************************************************************************/
 #include "sci.h"
 
 
/******************************************************************************/
/**
 * Function Name: void INIT_SCI(void)
 * Description: Initial the SCI 初始化SCI   
 * Param:   none
 * Return:  none
 * Author:  pine
 *****************************************************************************/
  void INIT_SCI(void) 
  {
  SCI0BD =BUS_CLOCK/16/BAUD; //9;   //设置SCI0波特率为115200
  SCI0CR1 = 0x00;        //设置SCI0为正常模式，八位数据位，无奇偶校验
  SCI0CR2 = 0x2c;        //允许接收和发送数据，允许接收中断功能 
  //SCI0ACR1=0X80;
  }
 

/******************************************************************************/
/**
 * Function Name: void BYTESEND_SCI(void)
 * Description: Send the SCI data 发送单个字节数据函数   
 * Param:   data 要发送的数据
 * Return:  none
 * Author:  pine
 *****************************************************************************/  
/*************************************************************/
/*                       串口发送函数                        */
/*************************************************************/
void BYTESEND_SCI(uchar data) 
{
  while(!SCI0SR1_TDRE);         //等待发送数据寄存器（缓冲器）为空
  SCI0DRL = data;
}


/******************************************************************************/
/**
 * Function Name: void STRINGSEND_SCI(void)
 * Description: Send the SCI data 发送多个字节数据函数   
 * Param:   *data 要发送的数组的首地址  num1 要发送的数据的个数
 * Return:  none
 * Author:  pine
 *****************************************************************************/  
/*************************************************************/
/*                       串口发送函数                        */
/*************************************************************/
void STRINGSEND_SCI(uchar *data, uint num1) 
  {uint i;
   for(i=0;i<num1;i++) 
   BYTESEND_SCI(*(data+i)); 
  }

 
/******************************************************************************/
/**
 * Function Name: void RECEIVE_SCI(void)
 * Description: Receive the SCI data 接收单个字节数据   
 * Param:   none
 * Return:  none
 * Author:  pine
 *****************************************************************************/  
/*************************************************************/
/*                       串口接收函数                        */
/*************************************************************/
uchar RECEIVE_SCI(void) 
{
  while(!SCI0SR1_RDRF);          //等待发送数据寄存器满
  return(SCI0DRL);
}



